Lista 4/itema/app/controllers/cars_controller.rb

    def index
        @car = Car.all
---
SELECT "cars".* FROM "cars"

    def create
        @car = Car.new(car_params)

        if @car.save
---
INSERT INTO "cars" ("plate", "cartype", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["plate", "123456"], ["cartype", 1], ["year", 1234], ["created_at", "2017-11-21 15:38:49.345147"], ["updated_at", "2017-11-21 15:38:49.345147"]]

    def update
        @car = Car.find(params[:id])

        if @car.update(car_params)
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "cars" SET "plate" = ?, "cartype" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["plate", "OIU7654"], ["cartype", 1], ["updated_at", "2017-11-23 12:58:14.491741"], ["id", 4]]

    def destroy
        @car = Car.find(params[:id])
        @car.destroy
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 1]]