Lista 4/itema/app/controllers/clients_controller.rb

SELECT "clients".* FROM "clients"
---
    def index
        @client = Client.all

INSERT INTO "clients" ("name", "address", "cpf", "rg", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Luiza"], ["address", "Rua Vereador"], ["cpf", "121289371"], ["rg", "129837163"], ["created_at", "2017-11-21 13:39:47.829387"], ["updated_at", "2017-11-21 13:39:47.829387"]]
---
    def create
        @client = Client.new(client_params)

        if @client.save

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "clients" SET "name" = ?, "address" = ?, "cpf" = ?, "rg" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["name", "oioioi"], ["address", "i9"], ["cpf", "9"], ["rg", "8"], ["updated_at", "2017-11-21 14:16:01.512634"], ["id", 2]]
---
    def update
        @client = Client.find(params[:id])

        if @client.update(client_params)

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "clients" WHERE "clients"."id" = ?  [["id", 1]]
---
    def destroy
        @client = Client.find(params[:id])
        @client.destroy