Lista 4/itema/app/controllers/rentals_controller.rb

SELECT "rentals".* FROM "rentals"
---
    def index
        @rental = Rental.all

SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @rental = Rental.find(params[:id])

SELECT "cars".* FROM "cars"
SELECT "cars".* FROM "cars" INNER JOIN "rentals" ON "rentals"."car_id" = "cars"."id" WHERE (rentals.end_date > '2017-11-23')
---
    def new
        @rental = Rental.new

        @all_cars = Car.all
        @busy_cars = Car.all.joins(:rentals).where('rentals.enddate > ?', Date.today)

SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cars".* FROM "cars"
SELECT "cars".* FROM "cars" INNER JOIN "rentals" ON "rentals"."car_id" = "cars"."id" WHERE (rentals.enddate > '2017-11-23')
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def edit
        @rental = Rental.find(params[:id])

        @all_cars = Car.all
        @busy_cars = Car.all.joins(:rentals).where('rentals.enddate > ?', Date.today)

        @available_cars = @all_cars - @busy_cars

        @available_cars.push(Car.find(@rental.car_id))

INSERT INTO "rentals" ("client_id", "car_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["client_id", 5], ["car_id", 4], ["created_at", "2017-11-22 22:02:16.871861"], ["updated_at", "2017-11-22 22:02:16.871861"]]
---
    def create
        @rental = Rental.new(rental_params)

        if @rental.save

SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def update
        @rental = Rental.find(params[:id])

SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "rentals" WHERE "rentals"."id" = ?  [["id", 1]]
---
    def destroy
        @rental = Rental.find(params[:id])
        @rental.destroy