Lista 4/itema/app/views/rentals/_form.html.erb

SELECT "clients".* FROM "clients"
SELECT "rentals".* FROM "rentals"
---
        <%= f.label :client %><br>
        <%= select(:rental, :client_id, Client.all.collect {|client| [ client.name, client.id ] }, {:prompt => 'Select client...'}) %>